# Pandas

Pandas is the most popular Python library that is used for data analysis. Pandas is built on top of the NumPy package, meaning a lot of the structure of NumPy is used or replicated in Pandas. This Notebook can also be skipped at first. Most parts of it will be explained in the Machine Learning Notebooks. You can read it afterwords as well.

<img src="./resources/pandas.png"  style="height: 200px"/>

Pandas is an easy package to install.

In [1]:
pip install pandas

Collecting pandas
  Downloading pandas-1.5.0-cp310-cp310-win_amd64.whl (10.4 MB)
     --------------------------------------- 10.4/10.4 MB 11.3 MB/s eta 0:00:00
Requirement already satisfied: numpy>=1.21.0 in c:\users\u0040810\onedrive - thomas more\ai project\2022_2023\ml_env\lib\site-packages (from pandas) (1.23.3)
Collecting pytz>=2020.1
  Downloading pytz-2022.4-py2.py3-none-any.whl (500 kB)
     ------------------------------------- 500.8/500.8 kB 10.4 MB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\u0040810\onedrive - thomas more\ai project\2022_2023\ml_env\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\u0040810\onedrive - thomas more\ai project\2022_2023\ml_env\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Installing collected packages: pytz, pandas
Successfully installed pandas-1.5.0 pytz-2022.4
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.2.1 -> 22.2.2
[notice] To update, run: python.exe -m pip install --upgrade pip

The primary two components of Pandas are the Series and DataFrame. A Series is essentially a column, and a DataFrame is a multi-dimensional table made up of a collection of Series.

<img src="./resources/series.png"  style="height: 150px"/>

## 1. Creating DataFrames from scratch

There are many ways to create a DataFrame from scratch, but a great option is to just use a simple dictionary.

In [5]:
import pandas as pd

# creating a dictionary
data = {
    'apples': [3, 2, 0, 1], 
    'oranges': [0, 3, 7, 2]
}

purchases = pd.DataFrame(data)

purchases

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

The Index of this DataFrame was given to us on creation as the numbers 0-3, but we could also create our own when we initialize the DataFrame.

In [6]:
purchases = pd.DataFrame(data, index=['June', 'Robert', 'Lily', 'David'])

purchases

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

So now we could locate a customer's order by using his name.

In [7]:
purchases.loc['June']

apples     3
oranges    0
Name: June, dtype: int64

## 2. Reading data from CSVs

It’s quite simple to load data from various file formats into a DataFrame. With CSV files all you need is a single line to load in the data.

In [8]:
movies_df = pd.read_csv("resources/IMDB-Movie-Data.csv", index_col="Title")

The first thing to do when opening a new dataset is print out a few rows to keep as a visual reference. We accomplish this with `.head()`.

In [9]:
movies_df.head()

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,,
Guardians of the Galaxy,1,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
Sing,4,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
Suicide Squad,5,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0

We could also pass a number as well: `movies_df.head(10)` would output the top ten rows. To see the last five rows use `.tail()`. `tail()`also accepts a number.

In [10]:
movies_df.tail(2)

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,,
Search Party,999,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
Nine Lives,1000,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

You'll notice that the index in our DataFrame is the Title column, which you can see by how the word Title is slightly lower than the rest of the columns.

Remember: we explicitely told pandas when importing the file, that the Title column should be used as an index: 'movies_df = pd.read_csv("resources/IMDB-Movie-Data.csv", **index_col="Title"**)'

In [11]:
movies_df.loc['Sing']

Rank                                                                  4
Genre                                           Animation,Comedy,Family
Description           In a city of humanoid animals, a hustling thea...
Director                                           Christophe Lourdelet
Actors                Matthew McConaughey,Reese Witherspoon, Seth Ma...
Year                                                               2016
Runtime (Minutes)                                                   108
Rating                                                              7.2
Votes                                                             60545
Revenue (Millions)                                               270.32
Metascore                                                          59.0
Name: Sing, dtype: object

`.info()` provides the essential details about your dataset, such as the number of rows and columns, the number of non-null values, what type of data is in each column, and how much memory your DataFrame is using.

In [12]:
movies_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, Guardians of the Galaxy to Nine Lives
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                1000 non-null   int64
 1   Genre               1000 non-null   object
 2   Description         1000 non-null   object
 3   Director            1000 non-null   object
 4   Actors              1000 non-null   object
 5   Year                1000 non-null   int64
 6   Runtime (Minutes)   1000 non-null   int64
 7   Rating              1000 non-null   float64
 8   Votes               1000 non-null   int64
 9   Revenue (Millions)  872 non-null    float64
 10  Metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(4)
memory usage: 126.0+ KB

Another fast and useful attribute is .shape, which outputs just a tuple of (rows, columns).

In [13]:
movies_df.shape

(1000, 11)

## 3. Cleaning and transforming data

### Handling duplicates

This dataset does not have duplicate rows, but it is always important to verify you aren't aggregating duplicate rows.

To demonstrate, let's simply just double up our movies DataFrame by appending it to itself.

In [14]:
temp_df = movies_df.append(movies_df)

temp_df.shape

C:\Users\u0040810\AppData\Local\Temp\ipykernel_24740\3236548275.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  temp_df = movies_df.append(movies_df)

(2000, 11)

Now we can try dropping duplicates.

In [15]:
temp_df = temp_df.drop_duplicates()

temp_df.shape

(1000, 11)

It's a little verbose to keep assigning DataFrames to the same variable like in this example. For this reason, Pandas has the inplace keyword argument on many of its methods. Using `inplace=True` will modify the DataFrame object in place. Now our temp_df will have the transformed data automatically.

In [16]:
temp_df.drop_duplicates(inplace=True)

### Column cleanup

Many times datasets will have verbose column names with symbols, upper and lowercase words, spaces, and typos. To make selecting data by column name easier we can spend a little time cleaning up their names.

Here's how to print the column names of our dataset.

In [17]:
movies_df.columns

Index(['Rank', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

We can use the `.rename()` method to rename certain or all columns via a dict. We don't want parentheses, so let's rename those.

In [18]:
movies_df.rename(columns={
        'Runtime (Minutes)': 'Runtime', 
        'Revenue (Millions)': 'Revenue_millions'
    }, inplace=True)


movies_df.columns

Index(['Rank', 'Genre', 'Description', 'Director', 'Actors', 'Year', 'Runtime',
       'Rating', 'Votes', 'Revenue_millions', 'Metascore'],
      dtype='object')

It's a good idea to lowercase, to remove special characters, and to replace spaces with underscores if you'll be working with a dataset for some time.

In [19]:
movies_df.columns = [col.lower() for col in movies_df]

movies_df.columns

Index(['rank', 'genre', 'description', 'director', 'actors', 'year', 'runtime',
       'rating', 'votes', 'revenue_millions', 'metascore'],
      dtype='object')

### Missing values

Let's first calculate to total number of nulls in each column of our dataset.

In [20]:
movies_df.isnull().sum()

rank                  0
genre                 0
description           0
director              0
actors                0
year                  0
runtime               0
rating                0
votes                 0
revenue_millions    128
metascore            64
dtype: int64

We can see now that our data has 128 missing values for revenue_millions and 64 missing values for metascore.

There are two options in dealing with nulls:

1. Get rid of rows or columns with nulls
2. Replace nulls with non-null values, a technique known as imputation

Removing nulls is pretty simple:

```python
movies_df.dropna(inplace=True)
```

This operation will delete any row with at least a single null value. This obviously seems like a waste since there's perfectly good data in the other columns of those dropped rows.

So instead we can impute that null with another value, usually the mean. Let's look at imputing the missing values in the revenue_millions column. First we'll extract that column into its own variable.

In [21]:
revenues = movies_df['revenue_millions']

revenues.head()

Title
Guardians of the Galaxy    333.13
Prometheus                 126.46
Split                      138.12
Sing                       270.32
Suicide Squad              325.02
Name: revenue_millions, dtype: float64

In [22]:
mean_revenue = revenues.mean()
mean_revenue

82.95637614678898

In [23]:
revenues.fillna(mean_revenue, inplace=True)

In [24]:
movies_df.isnull().sum()

rank                 0
genre                0
description          0
director             0
actors               0
year                 0
runtime              0
rating               0
votes                0
revenue_millions     0
metascore           64
dtype: int64

## 4. DataFrame slicing, selecting, extracting

Let's have a look at some methods of slicing, selecting, and extracting you'll need to use constantly.

It's important to note that, although many methods are the same, DataFrames and Series have different attributes, so you need to know which type you are working with or else you will receive attribute errors.

### By column

Extract a column using square brackets. This will return a Series.

In [25]:
genre_col = movies_df['genre']

type(genre_col)

pandas.core.series.Series

To extract a column as a DataFrame, you need to pass a list of column names.

In [26]:
genre_col = movies_df[['genre']]

type(genre_col)

pandas.core.frame.DataFrame

Since it's just a list, adding another column name is easy.

In [27]:
subset = movies_df[['genre', 'rating']]

subset.head()

                                            genre  rating
Title
Guardians of the Galaxy   Action,Adventure,Sci-Fi     8.1
Prometheus               Adventure,Mystery,Sci-Fi     7.0
Split                             Horror,Thriller     7.3
Sing                      Animation,Comedy,Family     7.2
Suicide Squad            Action,Adventure,Fantasy     6.2

### By rows

For rows, we have two options:

1. .loc locates by name
2. .iloc locates by numerical index

Remember that we are still indexed by movie Title, so to use .loc we give it the Title of a movie.

In [28]:
movie = movies_df.loc["Prometheus"]

movie

rank                                                                2
genre                                        Adventure,Mystery,Sci-Fi
description         Following clues to the origin of mankind, a te...
director                                                 Ridley Scott
actors              Noomi Rapace, Logan Marshall-Green, Michael Fa...
year                                                             2012
runtime                                                           124
rating                                                            7.0
votes                                                          485820
revenue_millions                                               126.46
metascore                                                        65.0
Name: Prometheus, dtype: object

On the other hand, with iloc we give it the numerical index of Prometheus.

In [29]:
movie = movies_df.iloc[1]

movie

rank                                                                2
genre                                        Adventure,Mystery,Sci-Fi
description         Following clues to the origin of mankind, a te...
director                                                 Ridley Scott
actors              Noomi Rapace, Logan Marshall-Green, Michael Fa...
year                                                             2012
runtime                                                           124
rating                                                            7.0
votes                                                          485820
revenue_millions                                               126.46
metascore                                                        65.0
Name: Prometheus, dtype: object

You can use loc and iloc as well to select multiple rows.

In [30]:
movie_subset1 = movies_df.loc['Prometheus':'Sing']
movie_subset1

,rank,genre,description,director,actors,year,runtime,rating,votes,revenue_millions,metascore
Title,,,,,,,,,,,
Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
Sing,4,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0

In [ ]:
movie_subset2 = movies_df.iloc[1:4] # the movie at index 4 (Suicide Squad) is not included
movie_subset2

### Conditional selections

We’ve gone over how to select columns and rows, but what if we want to make a conditional selection?

In [ ]:
movie_subset3 = movies_df[movies_df['director'] == "Ridley Scott"]
movie_subset3

Let's look at conditional selections using numerical values by filtering the DataFrame by ratings.

In [ ]:
movies_df[movies_df['rating'] >= 8.6].head(3)

We can make some richer conditionals by using logical operators: | for "or" and & for "and".

In [ ]:
movies_df[(movies_df['director'] == 'Christopher Nolan') | (movies_df['director'] == 'Ridley Scott')].head()

## 5. Calculating statistics

A very useful command is `.describe()` which outputs summary statistics for numerical columns.

In [33]:
movies_df.describe()

,rank,year,runtime,rating,votes,revenue_millions,metascore
count,1000.000000,1000.000000,1000.000000,1000.000000,1.000000e+03,1000.000000,936.000000
mean,500.500000,2012.783000,113.172000,6.723200,1.698083e+05,82.956376,58.985043
std,288.819436,3.205962,18.810908,0.945429,1.887626e+05,96.412043,17.194757
min,1.000000,2006.000000,66.000000,1.900000,6.100000e+01,0.000000,11.000000
25%,250.750000,2010.000000,100.000000,6.200000,3.630900e+04,17.442500,47.000000
50%,500.500000,2014.000000,111.000000,6.800000,1.107990e+05,60.375000,59.500000
75%,750.250000,2016.000000,123.000000,7.400000,2.399098e+05,99.177500,72.000000
max,1000.000000,2016.000000,191.000000,9.000000,1.791916e+06,936.630000,100.000000

It is also possible to get statistics on the entire data frame or a series (a column etc).

- `.mean()` returns the mean of all columns
- `.corr()` returns the correlation between columns in a data frame
- `.count()` returns the number of non-null values in each data frame column
- `.max()` returns the highest value in each column
- `.min()` returns the lowest value in each column 
- `.median()` returns the median of each column 
- `.std()` returns the standard deviation of each column

In [32]:
movies_df['rating'].mean()

6.723199999999999

In [31]:
movies_df[['rating' , 'revenue_millions', 'metascore']].corr()

                    rating  revenue_millions  metascore
rating            1.000000          0.189527   0.631897
revenue_millions  0.189527          1.000000   0.133328
metascore         0.631897          0.133328   1.000000